{"keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "use_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "activity_regularizer": null, "units": 256, "batch_input_shape": [null, 16, 512], "kernel_regularizer": null, "return_sequences": true, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_constraint": null, "go_backwards": false, "unit_forget_bias": true, "dtype": "float32", "stateful": false, "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dropout": 0.0, "implementation": 0}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "use_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "activity_regularizer": null, "units": 256, "kernel_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "unit_forget_bias": true, "stateful": false, "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dropout": 0.0, "implementation": 0}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "trainable": true, "activity_regularizer": null, "units": 512, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}]}