{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "LSTM", "config": {"stateful": false, "implementation": 0, "kernel_regularizer": null, "go_backwards": false, "units": 256, "recurrent_constraint": null, "dropout": 0.0, "bias_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "batch_input_shape": [null, 32, 512], "unroll": false, "return_sequences": true, "unit_forget_bias": true, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "name": "lstm_1", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "LSTM", "config": {"implementation": 0, "stateful": false, "kernel_regularizer": null, "go_backwards": false, "units": 256, "recurrent_constraint": null, "dropout": 0.0, "bias_constraint": null, "use_bias": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "bias_regularizer": null, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "name": "lstm_2", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "activation": "tanh", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "units": 512, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "backend": "tensorflow"}