{"keras_version": "2.0.8", "config": [{"config": {"trainable": true, "units": 128, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "go_backwards": false, "implementation": 0, "dtype": "float32", "batch_input_shape": [null, 16, 512], "use_bias": true, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "activation": "tanh", "return_state": false, "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "name": "lstm_1", "dropout": 0.0, "stateful": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "units": 128, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "go_backwards": false, "implementation": 0, "use_bias": true, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "activation": "tanh", "return_state": false, "unroll": false, "bias_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "name": "lstm_2", "dropout": 0.0, "stateful": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 512, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}