{"config": [{"config": {"dtype": "float32", "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "trainable": true, "name": "lstm_1", "recurrent_regularizer": null, "bias_constraint": null, "return_state": false, "use_bias": true, "go_backwards": false, "return_sequences": true, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "tanh", "unroll": false, "kernel_constraint": null, "recurrent_constraint": null, "batch_input_shape": [null, 32, 512], "bias_regularizer": null, "units": 128, "unit_forget_bias": true, "stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "trainable": true, "name": "lstm_2", "recurrent_regularizer": null, "bias_constraint": null, "return_state": false, "use_bias": true, "go_backwards": false, "return_sequences": true, "recurrent_dropout": 0.0, "dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "tanh", "unroll": false, "kernel_constraint": null, "recurrent_constraint": null, "bias_regularizer": null, "units": 128, "unit_forget_bias": true, "stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "name": "dense_1", "units": 512, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow"}