{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unit_forget_bias": true, "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "batch_input_shape": [null, 32, 512], "activation": "tanh", "recurrent_constraint": null, "kernel_regularizer": null, "units": 256, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "stateful": false, "return_state": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "go_backwards": false, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "trainable": true, "implementation": 0, "bias_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "tanh", "recurrent_constraint": null, "kernel_regularizer": null, "units": 256, "name": "lstm_2", "bias_constraint": null, "stateful": false, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "trainable": true, "implementation": 0, "bias_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "trainable": true, "units": 512, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "2.0.8", "backend": "tensorflow"}