{"config": [{"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "name": "lstm_1", "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "activation": "tanh", "unroll": false, "units": 256, "recurrent_constraint": null, "implementation": 0, "batch_input_shape": [null, 32, 512], "recurrent_regularizer": null, "stateful": false, "unit_forget_bias": true, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "dtype": "float32", "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "implementation": 0, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "name": "lstm_2", "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "activation": "tanh", "unroll": false, "units": 256, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "stateful": false, "unit_forget_bias": true, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activation": "linear", "bias_constraint": null, "units": 512, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}