{"config": [{"config": {"dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "unroll": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 0, "bias_constraint": null, "recurrent_constraint": null, "name": "lstm_1", "stateful": false, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "dtype": "float32", "batch_input_shape": [null, 5000, 512], "go_backwards": false, "use_bias": true, "recurrent_dropout": 0.0, "return_sequences": true, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "bias_regularizer": null, "units": 100}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "unroll": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "implementation": 0, "recurrent_dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "return_sequences": true, "recurrent_regularizer": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "units": 100}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "units": 512}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8"}