{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "dropout": 0.0, "recurrent_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "batch_input_shape": [null, 16, 512], "bias_constraint": null, "return_sequences": true, "name": "lstm_1", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "go_backwards": false, "return_state": false, "stateful": false, "units": 1, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "implementation": 0, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "dropout": 0.0, "recurrent_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "return_sequences": true, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "go_backwards": false, "return_state": false, "stateful": false, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "keras_version": "2.0.8"}