{"config": [{"config": {"unroll": false, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "tanh", "name": "lstm_1", "recurrent_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "implementation": 0, "batch_input_shape": [null, 32, 512], "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "return_state": false, "recurrent_dropout": 0.0, "units": 50, "return_sequences": true, "stateful": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"unroll": false, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "tanh", "name": "lstm_2", "recurrent_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "implementation": 0, "go_backwards": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "recurrent_dropout": 0.0, "units": 50, "return_sequences": true, "stateful": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 512, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}