{"config": [{"config": {"batch_input_shape": [null, 32, 512], "use_bias": true, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_1", "implementation": 0, "dtype": "float32", "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": false, "unroll": false, "stateful": false, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null, "units": 128, "return_sequences": true, "dropout": 0.0, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"use_bias": true, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_2", "implementation": 0, "return_sequences": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "go_backwards": false, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": false, "unroll": false, "stateful": false, "bias_regularizer": null, "activation": "tanh", "kernel_constraint": null, "units": 128, "dropout": 0.0, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "units": 512, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}