{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "LSTM", "config": {"return_state": false, "dropout": 0.0, "return_sequences": true, "stateful": false, "activity_regularizer": null, "name": "lstm_1", "batch_input_shape": [null, 16, 512], "trainable": true, "go_backwards": false, "bias_regularizer": null, "use_bias": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "dtype": "float32", "recurrent_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "recurrent_regularizer": null, "unroll": false}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "LSTM", "config": {"return_state": false, "dropout": 0.0, "return_sequences": true, "stateful": false, "activity_regularizer": null, "name": "lstm_2", "use_bias": true, "trainable": true, "recurrent_constraint": null, "go_backwards": false, "bias_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "recurrent_regularizer": null, "unroll": false}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "units": 512}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}