{"keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "batch_input_shape": [null, 5000, 512], "return_state": false, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "dropout": 0.0, "trainable": true, "recurrent_regularizer": null, "units": 2, "kernel_constraint": null, "implementation": 0, "return_sequences": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "name": "lstm_1", "go_backwards": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "stateful": false, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "return_state": false, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "dropout": 0.0, "trainable": true, "recurrent_regularizer": null, "units": 2, "kernel_constraint": null, "implementation": 0, "stateful": false, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "name": "lstm_2", "recurrent_constraint": null, "go_backwards": false, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_constraint": null, "recurrent_dropout": 0.0}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "linear", "bias_regularizer": null, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "units": 512, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}]}