{"backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, 5000, 512], "stateful": false, "implementation": 0, "name": "lstm_1", "kernel_constraint": null, "return_sequences": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "activity_regularizer": null, "units": 2, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_regularizer": null, "go_backwards": false, "return_state": false, "unit_forget_bias": true, "unroll": false, "recurrent_constraint": null, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"stateful": false, "implementation": 0, "name": "lstm_2", "kernel_constraint": null, "return_sequences": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "activity_regularizer": null, "units": 2, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_regularizer": null, "go_backwards": false, "return_state": false, "unit_forget_bias": true, "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "use_bias": true, "activation": "linear", "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "units": 512, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.0.8", "class_name": "Sequential"}