{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "dtype": "float32", "units": 1, "unit_forget_bias": true, "return_sequences": true, "bias_constraint": null, "kernel_constraint": null, "dropout": 0.0, "use_bias": true, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "stateful": false, "recurrent_constraint": null, "activation": "tanh", "batch_input_shape": [null, 32, 512], "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "implementation": 0, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "unroll": false, "kernel_regularizer": null, "recurrent_regularizer": null, "activity_regularizer": null, "go_backwards": false}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "units": 1, "unit_forget_bias": true, "return_sequences": true, "bias_constraint": null, "kernel_constraint": null, "dropout": 0.0, "use_bias": true, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "stateful": false, "recurrent_constraint": null, "activation": "tanh", "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "implementation": 0, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "unroll": false, "kernel_regularizer": null, "go_backwards": false, "activity_regularizer": null, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "activation": "linear", "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "name": "dense_1", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "keras_version": "2.0.8"}