{"config": [{"config": {"use_bias": true, "trainable": true, "kernel_regularizer": null, "stateful": false, "go_backwards": false, "return_sequences": true, "dtype": "float32", "return_state": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "name": "lstm_1", "bias_constraint": null, "bias_regularizer": null, "unroll": false, "batch_input_shape": [null, 32, 512], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "units": 1, "kernel_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activation": "tanh", "implementation": 0}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "trainable": true, "kernel_regularizer": null, "stateful": false, "go_backwards": false, "return_sequences": true, "return_state": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "name": "lstm_2", "bias_constraint": null, "bias_regularizer": null, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "units": 1, "kernel_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activation": "tanh", "implementation": 0}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 512, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential"}