{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "LSTM", "config": {"return_state": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "batch_input_shape": [null, 32, 512], "recurrent_dropout": 0.0, "recurrent_regularizer": null, "dropout": 0.0, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "lstm_1", "use_bias": true, "stateful": false, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "implementation": 0, "unroll": false, "return_sequences": true, "units": 128, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activation": "tanh", "unit_forget_bias": true, "go_backwards": false}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "LSTM", "config": {"return_state": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "dropout": 0.0, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "lstm_2", "use_bias": true, "stateful": false, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "implementation": 0, "unroll": false, "return_sequences": true, "units": 128, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "unit_forget_bias": true, "go_backwards": false}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "units": 512, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}], "backend": "tensorflow"}