{"backend": "tensorflow", "config": [{"config": {"activation": "tanh", "recurrent_dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "return_sequences": true, "implementation": 0, "trainable": true, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_constraint": null, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "lstm_1", "activity_regularizer": null, "dropout": 0.0, "batch_input_shape": [null, 2000, 512], "return_state": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_regularizer": null, "units": 53}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "recurrent_dropout": 0.0, "recurrent_constraint": null, "go_backwards": false, "bias_constraint": null, "kernel_regularizer": null, "return_sequences": true, "implementation": 0, "trainable": true, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_constraint": null, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "lstm_2", "activity_regularizer": null, "units": 53, "return_state": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_regularizer": null, "dropout": 0.0}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 512, "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.0.8", "class_name": "Sequential"}