{"keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "return_state": false, "bias_constraint": null, "kernel_regularizer": null, "return_sequences": true, "units": 50, "batch_input_shape": [null, 32, 512], "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dtype": "float32", "dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "bias_regularizer": null, "unroll": false, "activity_regularizer": null, "implementation": 0, "unit_forget_bias": true, "name": "lstm_1", "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"use_bias": true, "return_state": false, "bias_constraint": null, "kernel_regularizer": null, "units": 50, "return_sequences": true, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "implementation": 0, "bias_regularizer": null, "unroll": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "unit_forget_bias": true, "name": "lstm_2", "go_backwards": false, "recurrent_dropout": 0.0, "activation": "tanh", "recurrent_constraint": null, "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "units": 512, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "backend": "tensorflow"}