{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"trainable": true, "batch_input_shape": [null, 32, 512], "stateful": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "implementation": 0, "recurrent_regularizer": null, "kernel_regularizer": null, "return_state": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "dropout": 0.0, "return_sequences": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "go_backwards": false, "dtype": "float32", "unit_forget_bias": true, "use_bias": true, "units": 128, "name": "lstm_1", "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "LSTM", "config": {"trainable": true, "bias_constraint": null, "stateful": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "implementation": 0, "recurrent_regularizer": null, "kernel_regularizer": null, "return_state": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "lstm_2", "dropout": 0.0, "return_sequences": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "use_bias": true, "units": 128, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "units": 512, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "dense_1", "activation": "linear", "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}]}