{"keras_version": "2.0.8", "config": [{"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "kernel_constraint": null, "dropout": 0.0, "return_sequences": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "lstm_1", "stateful": false, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "activity_regularizer": null, "units": 256, "recurrent_constraint": null, "bias_constraint": null, "batch_input_shape": [null, 32, 512], "activation": "tanh", "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "return_state": false, "unroll": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "kernel_constraint": null, "dropout": 0.0, "return_sequences": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "lstm_2", "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "activity_regularizer": null, "units": 256, "recurrent_constraint": null, "bias_constraint": null, "activation": "tanh", "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "return_state": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_regularizer": null, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 512}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}