{"backend": "tensorflow", "config": [{"config": {"go_backwards": false, "dtype": "float32", "return_sequences": true, "stateful": false, "bias_regularizer": null, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "unroll": false, "units": 1, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "dropout": 0.0, "kernel_regularizer": null, "unit_forget_bias": true, "batch_input_shape": [null, 2000, 512], "bias_constraint": null, "name": "lstm_1", "trainable": true, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "return_state": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"go_backwards": false, "recurrent_dropout": 0.0, "return_sequences": true, "stateful": false, "bias_regularizer": null, "implementation": 0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "unroll": false, "units": 1, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "dropout": 0.0, "kernel_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "name": "lstm_2", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "return_state": false}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "units": 512, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.8", "class_name": "Sequential"}