{"backend": "tensorflow", "keras_version": "2.0.8", "config": [{"config": {"use_bias": true, "batch_input_shape": [null, 16, 512], "recurrent_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "return_sequences": true, "unroll": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "return_state": false, "dropout": 0.0, "dtype": "float32", "name": "lstm_1", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 512, "implementation": 0, "stateful": false, "go_backwards": false, "kernel_regularizer": null, "unit_forget_bias": true, "bias_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "recurrent_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "return_sequences": true, "unroll": false, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "return_state": false, "name": "lstm_2", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 512, "recurrent_dropout": 0.0, "implementation": 0, "stateful": false, "go_backwards": false, "kernel_regularizer": null, "unit_forget_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "name": "dense_1", "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "units": 512, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}